src/cf/Reports/ОзнакомлениеСОбъектом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОзнакомлениеСОбъектом</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/УчастникиОзнакомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчастникиОзнакомлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеОзнакомленияПодПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОзнакомленияПодПодпись</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторУчастникаДействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатОзнакомленияТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОзнакомления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСотрудникаДляПЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСотрудникаДляПЭПЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСотрудникаДляПЭПЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФактическогоИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФактическогоИсполнителяЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФактическогоИсполнителяЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияОзнакомления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Reports/ОзнакомлениеСОбъектом/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Документ) Тогда 
		ПараметрДокумент = Новый ПараметрКомпоновкиДанных("Документ"); 
		ЭлементНастроек = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДокумент);
		Если ЭлементНастроек <> Неопределено Тогда 
			ЭлементНастроек.Значение = Документ;
			ЭлементНастроек.Использование = Истина;
		КонецЕсли;
		
		ДействияОзнакомления = ДействияМассовогоОзнакомления(Документ);
		
		ПараметрДействия = Новый ПараметрКомпоновкиДанных("ДействияОзнакомления"); 
		ЭлементНастроек = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДействия);
		Если ЭлементНастроек <> Неопределено Тогда 
			ЭлементНастроек.Значение = ДействияОзнакомления;
			ЭлементНастроек.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Документ) Тогда 
		ПараметрДокумент = Новый ПараметрКомпоновкиДанных("Документ"); 
		
		ЭлементНастроек = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДокумент);
		Если ЭлементНастроек <> Неопределено Тогда 
			ЭлементНастроек.Значение = Документ;
			ЭлементНастроек.Использование = Истина;
		КонецЕсли;  
		
		ДействияОзнакомления = ДействияМассовогоОзнакомления(Документ);
		
		ПараметрДействия = Новый ПараметрКомпоновкиДанных("ДействияОзнакомления"); 
		ЭлементНастроек = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДействия);
		Если ЭлементНастроек <> Неопределено Тогда 
			ЭлементНастроек.Значение = ДействияОзнакомления;
			ЭлементНастроек.Использование = Истина;
		КонецЕсли;
		
		ПараметрЗаголовок = Новый ПараметрКомпоновкиДанных("Заголовок");
		ЭлементНастроек = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(ПараметрЗаголовок);
		Если ЭлементНастроек <> Неопределено Тогда 
			
			ДатаНачала = Неопределено;
			Если ДействияОзнакомления.Количество() = 1 Тогда                           
				Действие = ДействияОзнакомления[0];
				ДатаНачала = РегистрыСведений.УчастникиОзнакомлений.ДатаНачала(Действие);
			КонецЕсли;	
			
			ЭтаФорма.Заголовок = ЭлементНастроек.Значение;
			ЭлементНастроек.Использование = Истина;
			НаименованиеДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Наименование");
			Если СтрНайти(ЭлементНастроек.Значение, НаименованиеДокумента) = 0 Тогда 
				
				Если ДелопроизводствоКлиентСервер.ЭтоДокументПредприятия(Документ) Тогда
					ЭлементНастроек.Значение = СтрШаблон( НСтр("ru = 'Ознакомление с документом ""%1"" '"),
						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Наименование"));  
				Иначе	
					ЭлементНастроек.Значение = СтрШаблон( НСтр("ru = 'Ознакомление с мероприятием ""%1"" '"),
						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Наименование"));  
				КонецЕсли;	
					
				Если ЗначениеЗаполнено(ДатаНачала) Тогда        
					
					ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
					СтрокаФормата = ?(ИспользоватьДатуИВремяВСрокахЗадач, 
						"ДФ='дд.ММ.гггг ЧЧ:мм'", "ДЛФ=D");
					
					ЭлементНастроек.Значение = ЭлементНастроек.Значение 
					+ СтрШаблон( НСтр("ru = ' (начато: %1)'"), 
					Формат(ДатаНачала, СтрокаФормата));
					
				КонецЕсли;	
					
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПараметрДокумент = Новый ПараметрКомпоновкиДанных("ДействияОзнакомления");
	ЭлементНастроек = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДокумент);
	Если ЭлементНастроек = Неопределено Или ЭлементНастроек.Использование = Ложь Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не включен параметр ""Действия ознакомления""'"),,
			"Отчет.КомпоновщикНастроек.ПользовательскиеНастройки",,Отказ);
	ИначеЕсли ЗначениеЗаполнено(ЭлементНастроек.Значение) 
		И ЭлементНастроек.Значение.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'В данном документе нет действий в ""массовом режиме"".'"),,
			"Отчет.КомпоновщикНастроек.ПользовательскиеНастройки",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") И ЗначениеЗаполнено(Параметры.Документ) Тогда 
		Документ = Параметры.Документ;
	КонецЕсли;   
	
КонецПроцедуры  

&НаСервере
Функция ДействияМассовогоОзнакомления(Документ)
	
	ДействияМассовогоОзнакомления = Новый Массив;
	ВсеДействия = ДействияСервер.ТекущиеДействияПредмета(Документ,, Дата(1, 1, 1)).Выгрузить();
	МассивДействий = ВсеДействия.ВыгрузитьКолонку("Действие");        
	
	Для Каждого Действие Из МассивДействий Цикл               
		
		Если ТипЗнч(Действие) = Тип("СправочникСсылка.ДействияОзнакомления") Тогда
			ДействияМассовогоОзнакомления.Добавить(Действие);
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ДействияМассовогоОзнакомления;
	
КонецФункции
